app/controllers/api/v1/restaurants_controller.rb

	def items
		if @restaurant.present?
			items = @restaurant.products.paginate(:page => params[:page], :per_page => PER_PAGE)
---
SELECT  "products".* FROM "products" WHERE "products"."restaurant_id" = $1 LIMIT 2 OFFSET 0  [["restaurant_id", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."restaurant_id" = $1  [["restaurant_id", 1]]

		def set_restaurant
			@restaurant = Restaurant.find_by_id(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 4]]